; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-13)
(:domain gripper-strips)
(:objects rooma roomb left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 )
(:init
(room rooma)
(room roomb)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(free left)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 13
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 6 of 13
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 13
4. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 7 of 13
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 13
6. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 7 of 13
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 13
8. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 8 of 13
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 13
10. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 8 of 13
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 13
12. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 9 of 13
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 13
14. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 9 of 13
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 13
16. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 10 of 13
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 13
18. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 10 of 13
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 13
20. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 11 of 13
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 13
22. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 11 of 13
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 13
24. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 12 of 13
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 13
26. (pick ball2 roomb left)
   deleted: (at ball2 roomb) (free left)
   added: (carry ball2 left)
   goals met: 12 of 13
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 13
28. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 13 of 13
